[
    {
      "name": "Prep Work",
      "heading": "Prep Work: Get Ready to Start the Training",
      "description": "Our DevOps training program is intensive and hands-on. To be fully prepared for the training, you must complete 20 hours of preparation work that will provide you with essential knowledge of software development, system administration, and basic programming concepts.",
      "descriptionbullet": "Introduction to Software Development, Version Control with Git, Basics of System Administration, Command Line and Shell Scripting, Basics of Programming (Python or JavaScript).",
      "hours": "20 hours",
      "warning": "What you will do in practice",
      "warningBullet": "Set up a Git repository and perform version control tasks, Practice Linux/Windows command line and basic shell scripting, Write simple Python/JavaScript programs."
    },
    {
      "name": "Module 1",
      "heading": "Module 1: Introduction to DevOps",
      "description": "This module provides an introduction to DevOps, covering the principles, culture, and practices that bridge the gap between development and operations. Participants will learn about the benefits of DevOps and its role in modern software development.",
      "descriptionbullet": "In this module, participants will be introduced to the field of DevOps. They will learn about the principles, culture, and practices that bridge the gap between development and operations. Participants will also gain an understanding of the benefits of DevOps and its role in modern software development.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings:",
      "warningBullet": "Understand the fundamentals of DevOps, \r * Collaborate effectively in cross-functional teams, \r * Automate software development and deployment processes, \r * Implement DevOps best practices for continuous integration and delivery."
    },
    {
      "name": "Module 2",
      "heading": "Module 2: Version Control and Collaboration",
      "description": "Description: ",
      "descriptionbullet": "This module focuses on version control systems and collaboration tools. Participants will learn how to use Git for version control, manage code repositories, and collaborate effectively in distributed teams.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings:",
      "warningBullet": "Set up Git repositories and manage code versions, \r * Collaborate with distributed teams using Git, \r * Resolve code conflicts and perform code reviews, \r * Implement Git workflows for efficient collaboration."
    },
    {
      "name": "Module 3",
      "heading": "Module 3: Continuous Integration and Continuous Deployment (CI/CD)",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will learn about continuous integration and continuous deployment (CI/CD) practices. They will understand how to automate the build, test, and deployment processes to achieve faster and more reliable software delivery.",
      "hours": "Hours: 35 hours",
      "warning": "Learnings: ",
      "warningBullet": "Set up automated CI/CD pipelines for software delivery, \r * Automate build, test, and deployment processes, \r * Implement testing strategies for quality assurance, \r * Integrate automated testing into the CI/CD pipeline."
    },
    {
      "name": "Module 4",
      "heading": "Module 4: Cloud Infrastructure and Containerization",
      "description": "Description:",
      "descriptionbullet": "This module delves into cloud infrastructure and containerization technologies. Participants will learn how to deploy applications on cloud platforms like AWS or Azure and containerize applications using Docker.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings: ",
      "warningBullet": "Set up and manage cloud infrastructure on AWS or Azure, \r * Deploy applications on cloud platforms, \r * Containerize applications using Docker, \r * Orchestrate containers with Kubernetes for scalable deployments."
    },
    {
      "name": "Module 5",
      "heading": "Module 5: Infrastructure as Code and Configuration Management",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will learn about infrastructure as code and configuration management. They will understand how to automate infrastructure provisioning and configuration using tools like Terraform and Ansible.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings: ",
      "warningBullet": "Automate infrastructure provisioning with Terraform, \r * Manage and configure servers using Ansible, \r * Implement version control for infrastructure code, \r * Integrate infrastructure as code into the CI/CD pipeline."
    },
    {
      "name": "Interview & Career Prep",
      "heading": "Module 6: Interview and Career Preparation",
      "description": "This module is dedicated to preparing participants for successful job interviews and launching their careers in DevOps. Students will learn essential soft skills, interview techniques, and how to showcase their DevOps expertise effectively. Additionally, they will receive guidance on building a strong resume and preparing for the job search in the DevOps field.",
      "descriptionbullet": "",
      "hours": "Hours: 15 hours",
      "warning": "Learnings: ",
      "warningBullet": "Develop effective communication and presentation skills for interviews, \r * Practice technical and scenario-based interview questions, \r * Demonstrate hands-on DevOps skills during interviews, \r * Receive guidance on resume building and tailoring it for DevOps roles, \r * Explore job search strategies and networking techniques in the DevOps industry. By the end of this module, participants will be well-prepared to excel in job interviews, confidently showcase their DevOps expertise, and begin a successful career in the field of DevOps."
    }
  ]
  