[
  {
    "name": "Paper Work",
    "heading": "Prepwork: get ready to start the bootcamp",
    "description": "Our Java development course is very intense. To be prepared and make the most out of the bootcamp, you must complete a 20 hours preparation work to gives you basic tech foundations and culture.",
    "descriptionbullet": "Web 101, how the web works Terminal and Git basic commands HTML, CSS and JavaScript foundations Tech workflows and tools in a startup, The Java Full Stack Development Bootcamp is a comprehensive program designed to equip participants with the skills and knowledge needed to become proficient full stack developers using Java technologies. Through a hands-on approach, students will gain a solid foundation in both front-end and back-end development, allowing them to build robust and scalable web applications. This bootcamp is suitable for beginners with basic programming knowledge and experienced developers looking to expand their expertise in Java full stack development.",
    "hours": "20 hours",
    "warning": "What you will do in practice",
    "warningBullet": "10 hours of online discussion and Online quiz to validate basic tech knowledge"
  },
  {
    "name": "Module 1",
    "heading": "Module 1: Introduction to Java Programming",
    "description": "This module introduces participants to the fundamentals of Java programming, including data types, variables, control structures, and object-oriented programming (OOP) concepts. Students will develop the skills necessary to write efficient and well-structured Java code, setting the groundwork for their full stack development journey.",
    "descriptionbullet": "In this module, students will be introduced to the fundamentals of Java programming. They will learn about data types, variables, control structures, and object-oriented programming (OOP) concepts. Participants will develop the skills necessary to write efficient and well-structured Java code, setting the groundwork for their full stack development journey.",
    "hours": "Hours: 20 hours",
    "warning": "Learnings:",
    "warningBullet": "Understand Java syntax and basic programming concepts  \r  * Create and manage variables and data structures in Java \r * Implement control structures for decision-making and loops \r * Apply object-oriented principles in Java programming"
  },
  {
    "name": "Module 2",
    "heading": "Module 2: Front-End Development with Java",
    "description": "Description: ",
    "descriptionbullet": "This module focuses on front-end web development using Java technologies. Students will learn HTML, CSS, and JavaScript, along with popular front-end frameworks such as Angular or React. They will gain hands-on experience building interactive and responsive user interfaces, enabling them to create engaging and user-friendly web applications.",
    "hours": "Hours: 30 hours",
    "warning": "Learnings: ",
    "warningBullet": "Build web pages using HTML and style them with CSS \r *Develop dynamic front-end functionality using JavaScript \r * Utilize front-end frameworks to enhance user interfaces\r * Implement responsive design for various devices"
  },
  {
    "name": "Module 3",
    "heading": "Module 3: Back-End Development with Java",
    "description": "Description: ",
    "descriptionbullet": "This module delves into back-end development with Java. Topics covered include server-side programming, database management, and RESTful API development. Students will work with Java frameworks like Spring or JavaEE, learning how to build robust and secure back-end systems to support their web applications.",
    "hours": "Hours: 40 hours",
    "warning": "Learnings:",
    "warningBullet": "Design and implement server-side logic using Java\r * Manage databases and perform CRUD operations \r * Create RESTful APIs for client-server communication \r * Implement security measures to protect back-end resources"
  },
  {
    "name": "Module 4",
    "heading": "Module 4: Database Management and ORM",
    "description": "Description:",
    "descriptionbullet": "This module focuses on database management and Object-Relational Mapping (ORM) with Java. Participants will learn about database design, SQL queries, and how to interact with databases using Java-based ORM tools like Hibernate. They will gain the skills needed to create efficient and scalable data storage solutions for their applications.",
    "hours": "Hours: 25 hours",
    "warning": "Learnings: ",
    "warningBullet": "Design and optimize relational databases \r * Write SQL queries for data manipulation and retrieval \r * Implement ORM techniques for object-oriented database access \r * Manage database transactions effectively"
  },
  {
    "name": "Module 5",
    "heading": "Module 5: Web Application Security",
    "description": "Description: ",
    "descriptionbullet": "Security is paramount in modern web development. In this module, students will explore various security threats and best practices for securing web applications built with Java. They will learn about authentication, authorization, encryption, and other security mechanisms to protect their applications and user data.",
    "hours": "Hours: 15 hours",
    "warning": "Learnings: ",
    "warningBullet": "Identify common web application security threats\r * Implement secure authentication and authorization mechanisms\r * Utilize encryption techniques to protect sensitive data\r * Apply security best practices to prevent common vulnerabilities"
  },
  
  {
    "name": "Module 6",
    "heading": "Module 6: Deployment and DevOps",
    "description": "Description: ",
    "descriptionbullet": " In the final module, students will learn about the deployment of Java web applications and the principles of DevOps. They will understand the process of deploying their projects to production servers and utilizing continuous integration and continuous deployment (CI/CD) pipelines. Additionally, participants will learn about application monitoring, debugging, and performance optimization to ensure smooth and efficient operations.",
    "hours": "Hours: 20 hours",
    "warning": "Learnings: ",
    "warningBullet": "Deploy Java applications to production servers\r * Set up and manage CI/CD pipelines for automated deployment\r * Monitor application performance and troubleshoot issues\r * Implement DevOps practices for efficient development and deployment"
  },
  {
    "name": "Career Prep",
    "heading": "Interview and Career Preparation",
    "description": "This module is dedicated to preparing participants for successful job interviews and kickstarting their careers in Java full stack development. Students will learn essential soft skills, interview techniques, and how to showcase their technical abilities effectively. Additionally, they will receive guidance on building a strong portfolio and resume to stand out in the competitive job market.",
    "descriptionbullet": "",
    "hours": "2 hours",
    "warning": "Learnings: ",
    "warningBullet": "Develop effective communication and presentation skills for interviews\r * Practice technical interview questions and problem-solving exercises\r * Learn how to demonstrate practical coding skills during technical interviews\r * Receive feedback and guidance on portfolio and resume building\r * Explore job search strategies and networking techniques in the tech industry :: By the end of this module, participants will be well-prepared to excel in job interviews, confidently showcase their technical expertise, and navigate the job market to embark on a successful career in Java full stack development. Upon completing the Java Full Stack Development Bootcamp, participants will possess comprehensive skills in front-end and back-end development with Java. They will be well-equipped to design, build, and deploy full-fledged web applications, positioning them as highly sought-after professionals in the tech industry."
  }
]
