[
    {
      "name": "Prep Work",
      "heading": "Prep Work: Get Ready to Start the Training",
      "description": "Our Project Manager training program is comprehensive and intensive. To be fully prepared for the training, you must complete 15 hours of preparation work that will provide you with foundational project management concepts and tools.",
      "descriptionbullet": "Introduction to Project Management, Project Management Methodologies, Project Initiation and Planning, Stakeholder Analysis, Basics of Project Scheduling and Budgeting.",
      "hours": "15 hours",
      "warning": "What you will do in practice",
      "warningBullet": "Participate in project planning exercises, Create a project scope document, Develop a basic project schedule and budget."
    },
    {
      "name": "Module 1",
      "heading": "Module 1: Introduction to Project Management",
      "description": "This module provides an introduction to project management, covering key project management principles, processes, and methodologies. Participants will learn about project lifecycle phases and the role of a project manager in successful project delivery.",
      "descriptionbullet": "In this module, participants will be introduced to the field of project management. They will learn about key project management principles, processes, and methodologies. Participants will also gain an understanding of project lifecycle phases and the role of a project manager in successful project delivery.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings:",
      "warningBullet": "Understand the fundamentals of project management, \r * Identify key project stakeholders and their roles, \r * Plan and initiate a project, \r * Apply project management methodologies for effective project execution."
    },
    {
      "name": "Module 2",
      "heading": "Module 2: Project Planning and Scope Management",
      "description": "Description: ",
      "descriptionbullet": "This module focuses on project planning and scope management. Participants will learn how to define project scope, create a comprehensive project plan, and effectively manage project requirements and changes.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings:",
      "warningBullet": "Define project scope and deliverables, \r * Develop a detailed project plan with clear objectives and milestones, \r * Manage project requirements and changes, \r * Use project management tools for effective planning and tracking."
    },
    {
      "name": "Module 3",
      "heading": "Module 3: Project Risk Management",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will learn about project risk management. They will understand how to identify, analyze, and mitigate project risks to ensure successful project outcomes.",
      "hours": "Hours: 20 hours",
      "warning": "Learnings: ",
      "warningBullet": "Identify potential project risks and their impact, \r * Analyze and prioritize risks for effective risk management, \r * Develop risk mitigation strategies and contingency plans, \r * Implement risk monitoring and control measures."
    },
    {
      "name": "Module 4",
      "heading": "Module 4: Project Execution and Monitoring",
      "description": "Description:",
      "descriptionbullet": "This module delves into project execution and monitoring. Participants will learn how to lead project teams, manage project resources, and monitor project progress to ensure timely and successful project delivery.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings: ",
      "warningBullet": "Lead and motivate project teams for optimal performance, \r * Allocate and manage project resources effectively, \r * Monitor project progress and performance, \r * Implement project change management processes."
    },
    {
      "name": "Module 5",
      "heading": "Module 5: Project Communication and Stakeholder Management",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will learn about project communication and stakeholder management. They will understand how to effectively communicate with stakeholders, manage stakeholder expectations, and address project issues and conflicts.",
      "hours": "Hours: 20 hours",
      "warning": "Learnings: ",
      "warningBullet": "Develop a project communication plan and strategy, \r * Manage stakeholder expectations and engagement, \r * Address project issues and conflicts with diplomacy, \r * Foster positive stakeholder relationships for project success."
    },
    {
      "name": "Interview & Career Prep",
      "heading": "Module 6: Interview and Career Preparation",
      "description": "This module is dedicated to preparing participants for successful job interviews and launching their careers as Project Managers. Students will learn essential soft skills, interview techniques, and how to showcase their project management expertise effectively. Additionally, they will receive guidance on building a strong resume and preparing for the job search in the project management field.",
      "descriptionbullet": "",
      "hours": "Hours: 10 hours",
      "warning": "Learnings: ",
      "warningBullet": "Develop effective communication and presentation skills for interviews, \r * Practice behavioral and situational interview questions, \r * Learn how to demonstrate project management skills during interviews, \r * Receive guidance on resume building and tailoring it for project management roles, \r * Explore job search strategies and networking techniques in the project management industry. By the end of this module, participants will be well-prepared to excel in job interviews, confidently showcase their project management expertise, and begin a successful career as a Project Manager."
    }
  ]
  