[
    {
      "name": "Paper Work",
      "heading": "Prepwork: Get Ready to Start the Bootcamp",
      "description": "Our React development course is very intense. To be prepared and make the most out of the bootcamp, you must complete a 20 hours preparation work to give you basic tech foundations and culture.",
      "descriptionbullet": "Web 101: How the web works, Terminal and Git basic commands, HTML, CSS, and JavaScript foundations, Tech workflows and tools in a startup.",
      "hours": "20 hours",
      "warning": "What you will do in practice",
      "warningBullet": "10 hours of online discussion and an Online quiz to validate basic tech knowledge"
    },
    {
      "name": "Module 1",
      "heading": "Module 1: Introduction to React Development",
      "description": "This module introduces participants to the fundamentals of React development. They will learn about React components, state management, and how to build interactive user interfaces. Students will gain the skills necessary to create dynamic and responsive web applications.",
      "descriptionbullet": "In this module, students will be introduced to the fundamentals of React development. They will learn about React components, state management, and how to build interactive user interfaces. Participants will gain the skills necessary to create dynamic and responsive web applications.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings:",
      "warningBullet": "Understand React components and its lifecycle methods, \r * Manage state and props in React applications, \r * Build interactive user interfaces using JSX and React hooks, \r * Implement React Router for navigation within a single-page application."
    },
    {
      "name": "Module 2",
      "heading": "Module 2: Back-End Development with Node.js and Express",
      "description": "Description: ",
      "descriptionbullet": "This module focuses on back-end development with Node.js and Express. Students will learn how to build server-side applications, handle HTTP requests, and interact with databases. They will gain hands-on experience in creating RESTful APIs to support their React front-end applications.",
      "hours": "Hours: 40 hours",
      "warning": "Learnings:",
      "warningBullet": "Create server-side applications with Node.js and Express, \r * Handle HTTP requests and responses, \r * Implement RESTful APIs for client-server communication, \r * Interact with databases using MongoDB and Mongoose."
    },
    {
      "name": "Module 3",
      "heading": "Module 3: Full Stack Integration",
      "description": "Description: ",
      "descriptionbullet": "In this module, students will integrate the front-end and back-end components of their web applications. They will learn how to connect React components to the back-end API, implement user authentication, and deploy their full stack applications.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings: ",
      "warningBullet": "Connect React front-end to the Node.js and Express back-end, \r * Implement user authentication using JWT, \r * Deploy full stack applications to cloud platforms like Heroku or AWS, \r * Perform testing and debugging to ensure application functionality."
    },
    {
      "name": "Module 4",
      "heading": "Module 4: Advanced React and Redux",
      "description": "Description:",
      "descriptionbullet": "This module delves into advanced topics in React development, including Redux for state management, React performance optimization, and handling asynchronous operations. Students will learn how to build scalable and maintainable React applications.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings: ",
      "warningBullet": "Implement Redux for state management in React applications, \r * Optimize React performance and improve application speed, \r * Handle asynchronous operations using Redux-Saga or Thunk, \r * Refactor and modularize React code for maintainability."
    },
    {
      "name": "Module 5",
      "heading": "Module 5: Testing and Debugging",
      "description": "Description: ",
      "descriptionbullet": "In this module, students will learn essential testing and debugging techniques for React applications. They will explore unit testing, integration testing, and debugging tools to ensure the reliability and stability of their code.",
      "hours": "Hours: 20 hours",
      "warning": "Learnings: ",
      "warningBullet": "Perform unit testing and integration testing for React components, \r * Use debugging tools like React Developer Tools and Chrome DevTools, \r * Identify and fix common bugs and errors in React applications, \r * Ensure code quality through code reviews and best practices."
    },
    {
      "name": "Module 6",
      "heading": "Module 6: Deployment and DevOps",
      "description": "Description: ",
      "descriptionbullet": "In the final module, students will learn about the deployment of React full stack applications and the principles of DevOps. They will understand the process of deploying their projects to production servers and utilizing continuous integration and continuous deployment (CI/CD) pipelines. Additionally, participants will learn about application monitoring, debugging, and performance optimization to ensure smooth and efficient operations.",
      "hours": "Hours: 20 hours",
      "warning": "Learnings: ",
      "warningBullet": "Deploy React full stack applications to production servers, \r * Set up and manage CI/CD pipelines for automated deployment, \r * Monitor application performance and troubleshoot issues, \r * Implement DevOps practices for efficient development and deployment."
    },
    {
      "name": "Interview & Career Prep",
      "heading": "Module 7: Interview and Career Preparation",
      "description": "This module is dedicated to preparing participants for successful job interviews and kickstarting their careers in React full stack development. Students will learn essential soft skills, interview techniques, and how to showcase their technical abilities effectively. Additionally, they will receive guidance on building a strong portfolio and resume to stand out in the competitive job market.",
      "descriptionbullet": "",
      "hours": "Hours: 15 hours",
      "warning": "Learnings: ",
      "warningBullet": "Develop effective communication and presentation skills for interviews, \r * Practice technical interview questions and problem-solving exercises, \r * Learn how to demonstrate practical coding skills during technical interviews, \r * Receive feedback and guidance on portfolio and resume building, \r * Explore job search strategies and networking techniques in the tech industry. By the end of this module, participants will be well-prepared to excel in job interviews, confidently showcase their technical expertise, and navigate the job market to embark on a successful career in React full stack development."
    }
  ]
  