[
    {
      "name": "Prep Work",
      "heading": "Prep Work: Get Ready to Start the Bootcamp",
      "description": "Our UI/UX Design Bootcamp is an intensive program that requires some preparation to ensure a smooth learning experience. You must complete 15 hours of preparation work to get familiar with design principles, tools, and user experience fundamentals.",
      "descriptionbullet": "Introduction to Design Principles, Basics of User Experience (UX) Design, UI Design Tools Overview (e.g., Adobe XD, Sketch), Interaction Design Fundamentals.",
      "hours": "15 hours",
      "warning": "What you will do in practice",
      "warningBullet": "Create wireframes and prototypes using design tools, Analyze user interfaces and user experiences of existing websites and apps."
    },
    {
      "name": "Module 1",
      "heading": "Module 1: Introduction to UI/UX Design",
      "description": "This module provides an introduction to UI/UX design, covering design principles, user-centered design, and the role of UI/UX designers in creating meaningful user experiences.",
      "descriptionbullet": "In this module, participants will be introduced to the field of UI/UX design. They will learn about design principles, user-centered design, and the role of UI/UX designers in creating meaningful user experiences. Participants will also gain an understanding of the importance of empathy and user research in the design process.",
      "hours": "Hours: 20 hours",
      "warning": "Learnings:",
      "warningBullet": "Understand the fundamentals of UI/UX design, \r * Conduct user research and analyze user needs, \r * Create user personas and user journey maps, \r * Apply design thinking principles to problem-solving."
    },
    {
      "name": "Module 2",
      "heading": "Module 2: User Interface (UI) Design",
      "description": "Description: ",
      "descriptionbullet": "This module focuses on user interface (UI) design, where participants will learn how to create visually appealing and intuitive user interfaces. They will explore design elements, typography, color theory, and responsive design principles.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings:",
      "warningBullet": "Apply design elements and principles in UI design, \r * Create visually appealing layouts and compositions, \r * Use typography effectively for better readability and hierarchy, \r * Understand color theory and its impact on user experience."
    },
    {
      "name": "Module 3",
      "heading": "Module 3: Interaction Design and Prototyping",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will dive into interaction design and prototyping. They will learn how to create interactive and user-friendly prototypes using design tools like Adobe XD or Sketch.",
      "hours": "Hours: 35 hours",
      "warning": "Learnings: ",
      "warningBullet": "Design interactive user experiences through wireframes and prototypes, \r * Implement micro-interactions and animations for enhanced user engagement, \r * Conduct usability testing and gather feedback for iteration, \r * Collaborate with developers for seamless design implementation."
    },
    {
      "name": "Module 4",
      "heading": "Module 4: User Experience (UX) Research and Testing",
      "description": "Description:",
      "descriptionbullet": "This module delves into user experience (UX) research and testing. Participants will learn how to conduct usability tests, analyze user feedback, and iterate designs based on user insights.",
      "hours": "Hours: 30 hours",
      "warning": "Learnings: ",
      "warningBullet": "Plan and conduct effective usability tests, \r * Analyze user feedback and identify design improvements, \r * Apply data-driven decision-making for UX enhancements, \r * Use UX research to inform design iterations."
    },
    {
      "name": "Module 5",
      "heading": "Module 5: Design System and Collaboration",
      "description": "Description: ",
      "descriptionbullet": "In this module, participants will learn about design systems and collaboration in design projects. They will explore the importance of design consistency and how to work efficiently with development teams.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings: ",
      "warningBullet": "Create and maintain a design system for scalable and consistent designs, \r * Collaborate effectively with cross-functional teams, \r * Hand off designs to developers using design tools and documentation, \r * Implement design version control for design iteration management."
    },
    {
      "name": "Module 6",
      "heading": "Module 6: Portfolio Development and Career Prep",
      "description": "Description: ",
      "descriptionbullet": "In the final module, participants will work on portfolio development to showcase their UI/UX design skills. They will also receive career preparation guidance to confidently apply for UI/UX design roles.",
      "hours": "Hours: 25 hours",
      "warning": "Learnings: ",
      "warningBullet": "Create a professional UI/UX design portfolio, \r * Showcase design projects and case studies effectively, \r * Prepare for UI/UX design job interviews, \r * Explore job search strategies and networking techniques in the design industry."
    }
  ]
  